zlgopen/ametal/soc/hdsc/drivers/include/gpio/hw/amhw_hc32f460_gpio.h
/*******************************************************************************
*                                 AMetal
*                       ----------------------------
*                       innovating embedded platform
*
* Copyright (c) 2001-2018 Guangzhou ZHIYUAN Electronics Co., Ltd.
* All rights reserved.
*
* Contact information:
* web site:    http://www.zlg.cn/
*******************************************************************************/

/**
 * \file
 * \brief GPIO 硬件操作接口
 *
 * 1. GPIO 引脚能够通过软件配置为输入输出；
 * 2. 所有GPIO 引脚默认为输入，在复位时中断禁能；
 * 3. 引脚寄存器允许引脚单独配置或多个同时配置。
 *
 * \internal
 * \par Modification history
 * - 1.00 
 * \endinternal
 */

#ifndef __AMHW_HC32F460_GPIO_H
#define __AMHW_HC32F460_GPIO_H

#ifdef __cplusplus
extern "C" {
#endif

#include "am_types.h"
#include "am_bitops.h"
#include "hc32f460_intctrl.h"

/**
 * \addtogroup amhw_hc32f460_if_gpio
 * \copydoc amhw_hc32f460_gpio.h
 * @{
 */

/**
 * \name GPIO 端口编号
 * @{
 */


/**
 *******************************************************************************
 ** \brief GPIO Port Index enumeration
 ******************************************************************************/
typedef enum en_portx
{
    AMHW_HC32F460_GPIO_PORT_A = 0,                          ///< port group A
    AMHW_HC32F460_GPIO_PORT_B = 1,                          ///< port group B
    AMHW_HC32F460_GPIO_PORT_C = 2,                          ///< port group C
    AMHW_HC32F460_GPIO_PORT_D = 3,                          ///< port group D
    AMHW_HC32F460_GPIO_PORT_E = 4,                          ///< port group E
    AMHW_HC32F460_GPIO_PORT_H = 5,                          ///< port group H
}en_portx_t;

/** @} */
 
/**
 * \name GPIO 引脚电平
 * @{
 */
#define AMHW_HC32F460_GPIO_LEVEL_LOW     0        /**< \brief 低电平 */
#define AMHW_HC32F460_GPIO_LEVEL_HIGH    1        /**< \brief 高电平 */
/** @} */

/* 使用无名结构体和联合体区域的开始 */
#if defined(__CC_ARM)
    #pragma push
    #pragma anon_unions
#elif defined(__ICCARM__)
    #pragma language=extended
#elif defined(__GNUC__)
#elif defined(__TMS470__)
#elif defined(__TASKING__)
    #pragma warning 586
#else
    #warning Not supported compiler t
#endif

/**
 * \brief gpio引脚中断触发方式定义
 */
typedef enum amhw_hc32f460_gpio_trig_mode {
    AMHW_HC32F460_PINT_TRIGGER_FALL       = 0x0,   /**< \brief 下降沿触发*/
    AMHW_HC32F460_PINT_TRIGGER_RISE       = 0x1,   /**< \brief 上升沿触发*/
    AMHW_HC32F460_PINT_TRIGGER_BOTH_EDGES = 0x2,   /**< \brief 双边沿触发*/
    AMHW_HC32F460_PINT_TRIGGER_LOW        = 0x3,   /**< \brief 低电平触发*/
} amhw_hc32f460_pin_trig_mode_t;

/**
 * \brief GPIO引脚驱动电路响应速度
 * \note 选择该枚举设置GPIO引脚驱动电路响应速度时，GPIO引脚也确定为输出方向
 */
typedef enum amhw_hc32f460_gpio_speed_mode {
    AMHW_HC32F460_GPIO_SPEED_LOW  = 0UL,
    AMHW_HC32F460_GPIO_SPEED_MID  = 1UL,
    AMHW_HC32F460_GPIO_SPEED_HIGH = 2UL
}amhw_hc32f460_gpio_speed_mode_t;

/**
 * \brief GPIO引脚模式
 *
 * \note 引脚作为输入与输出时，具有不同的模式
 */
typedef enum amhw_hc32f460_gpio_mode {
    
    /** \brief 当GPIO引脚的方向为输入方向，引脚具有以下几种模式 */
    AMHW_HC32F460_GPIO_MODE_AIN = 0x00,         /**< \brief 模拟输入模式     */
    AMHW_HC32F460_GPIO_MODE_IN_FLOATING = 0x01, /**< \brief 浮空输入模式     */
    AMHW_HC32F460_GPIO_MODE_IPD = 0x02,         /**< \brief 下拉输入模式     */
    AMHW_HC32F460_GPIO_MODE_IPU = 0x03,         /**< \brief 上拉输入模式     */

    /** \brief 当GPIO引脚的方向为输出方向，引脚具有以下几种模式 */
    AMHW_HC32F460_GPIO_MODE_OUT_PP = 0x04,      /**< \brief 通用推挽输出模式 */
    AMHW_HC32F460_GPIO_MODE_OUT_OD = 0x05,      /**< \brief 通用开漏输出模式 */    
    AMHW_HC32F460_GPIO_MODE_AOUT   = 0x06,      /**< \brief 模拟输出模式 */
    AMHW_HC32F460_GPIO_MODE_AF_PP  = 0x07,      /**< \brief 复用推挽输出模式 */
    AMHW_HC32F460_GPIO_MODE_AF_OD  = 0x08       /**< \brief 复用开漏输出模式 */
} amhw_hc32f460_gpio_mode_t;

/**
 *******************************************************************************
 ** \brief GPIO Function enumeration
 ******************************************************************************/
typedef enum amhw_hc32f460_gpio_afio
{
    AMHW_HC32F460_AFIO_GPIO       = 0u,               ///< function set to gpio
    AMHW_HC32F460_AFIO_FCMREF     = 1u,               ///< function set to fcm reference
    AMHW_HC32F460_AFIO_RTCOUT     = 1u,               ///< function set to rtc output
    AMHW_HC32F460_AFIO_VCOUT      = 1u,               ///< function set to vc output
    AMHW_HC32F460_AFIO_ADTRG      = 1u,               ///< function set to adc trigger
    AMHW_HC32F460_AFIO_MCLKOUT    = 1u,               ///< function set to mclk output
    AMHW_HC32F460_AFIO_TIM4       = 2u,               ///< function set to timer4
    AMHW_HC32F460_AFIO_TIM6       = 3u,               ///< function set to timer6
    AMHW_HC32F460_AFIO_TIMA0      = 4u,               ///< function set to timerA
    AMHW_HC32F460_AFIO_TIMA1      = 5u,               ///< function set to timerA
    AMHW_HC32F460_AFIO_TIMA2      = 6u,               ///< function set to timerA
    AMHW_HC32F460_AFIO_EMB        = 6u,               ///< function set to emb
    AMHW_HC32F460_AFIO_USART_CK   = 7u,               ///< function set to usart clk
    AMHW_HC32F460_AFIO_SPI_NSS    = 7u,               ///< function set to spi nss
    AMHW_HC32F460_AFIO_QSPI       = 7u,               ///< function set to qspi
    AMHW_HC32F460_AFIO_KEY        = 8u,               ///< function set to key
    AMHW_HC32F460_AFIO_SDIO       = 9u,               ///< function set to sdio
    AMHW_HC32F460_AFIO_I2S        = 10u,              ///< function set to i2s
    AMHW_HC32F460_AFIO_USBF       = 10u,              ///< function set to usb full speed
    AMHW_HC32F460_AFIO_EVNPT      = 14u,              ///< function set to event port
    AMHW_HC32F460_AFIO_EVENTOUT   = 15u,              ///< function set to event out
    AMHW_HC32F460_AFIO_USART1_TX  = 32u,              ///< function set to usart tx of ch.1
    AMHW_HC32F460_AFIO_USART3_TX  = 32u,              ///< function set to usart tx of ch.3
    AMHW_HC32F460_AFIO_USART1_RX  = 33u,              ///< function set to usart rx of ch.1
    AMHW_HC32F460_AFIO_USART3_RX  = 33u,              ///< function set to usart rx of ch.3
    AMHW_HC32F460_AFIO_USART1_RTS = 34u,              ///< function set to usart rts of ch.1
    AMHW_HC32F460_AFIO_USART3_RTS = 34u,              ///< function set to usart rts of ch.3
    AMHW_HC32F460_AFIO_USART1_CTS = 35u,              ///< function set to usart cts of ch.1
    AMHW_HC32F460_AFIO_USART3_CTS = 35u,              ///< function set to usart cts of ch.3
    AMHW_HC32F460_AFIO_USART2_TX  = 36u,              ///< function set to usart tx of ch.2
    AMHW_HC32F460_AFIO_USART4_TX  = 36u,              ///< function set to usart tx of ch.4
    AMHW_HC32F460_AFIO_USART2_RX  = 37u,              ///< function set to usart rx of ch.2
    AMHW_HC32F460_AFIO_USART4_RX  = 37u,              ///< function set to usart rx of ch.4
    AMHW_HC32F460_AFIO_USART2_RTS = 38u,              ///< function set to usart rts of ch.2
    AMHW_HC32F460_AFIO_USART4_RTS = 38u,              ///< function set to usart rts of ch.4
    AMHW_HC32F460_AFIO_USART2_CTS = 39u,              ///< function set to usart cts of ch.2
    AMHW_HC32F460_AFIO_USART4_CTS = 39u,              ///< function set to usart cts of ch.4
    AMHW_HC32F460_AFIO_SPI1_MOSI  = 40u,              ///< function set to spi mosi of ch.1
    AMHW_HC32F460_AFIO_SPI3_MOSI  = 40u,              ///< function set to spi mosi of ch.3
    AMHW_HC32F460_AFIO_SPI1_MISO  = 41u,              ///< function set to spi miso of ch.1
    AMHW_HC32F460_AFIO_SPI3_MISO  = 41u,              ///< function set to spi miso of ch.3
    AMHW_HC32F460_AFIO_SPI1_NSS0  = 42u,              ///< function set to spi nss0 of ch.1
    AMHW_HC32F460_AFIO_SPI3_NSS0  = 42u,              ///< function set to spi nss0 of ch.3
    AMHW_HC32F460_AFIO_SPI1_SCK   = 43u,              ///< function set to spi sck of ch.1
    AMHW_HC32F460_AFIO_SPI3_SCK   = 43u,              ///< function set to spi sck of ch.3
    AMHW_HC32F460_AFIO_SPI2_MOSI  = 44u,              ///< function set to spi mosi of ch.2
    AMHW_HC32F460_AFIO_SPI4_MOSI  = 44u,              ///< function set to spi mosi of ch.2
    AMHW_HC32F460_AFIO_SPI2_MISO  = 45u,              ///< function set to spi miso of ch.4
    AMHW_HC32F460_AFIO_SPI4_MISO  = 45u,              ///< function set to spi miso of ch.4
    AMHW_HC32F460_AFIO_SPI2_NSS0  = 46u,              ///< function set to spi nss0 of ch.2
    AMHW_HC32F460_AFIO_SPI4_NSS0  = 46u,              ///< function set to spi nss0 of ch.4
    AMHW_HC32F460_AFIO_SPI2_SCK   = 47u,              ///< function set to spi sck of ch.2
    AMHW_HC32F460_AFIO_SPI4_SCK   = 47u,              ///< function set to spi sck of ch.4
    AMHW_HC32F460_AFIO_I2C1_SDA   = 48u,              ///< function set to i2c sda of ch.1
    AMHW_HC32F460_AFIO_I2C3_SDA   = 48u,              ///< function set to i2c sda of ch.3
    AMHW_HC32F460_AFIO_I2C1_SCL   = 49u,              ///< function set to i2c scl of ch.1
    AMHW_HC32F460_AFIO_I2C3_SCL   = 49u,              ///< function set to i2c scl of ch.3
    AMHW_HC32F460_AFIO_I2C2_SDA   = 50u,              ///< function set to i2c sda of ch.2
    AMHW_HC32F460_AFIO_CAN1_TX    = 50u,              ///< function set to can tx of ch.1
    AMHW_HC32F460_AFIO_I2C2_SCL   = 51u,              ///< function set to i2c scl of ch.2
    AMHW_HC32F460_AFIO_CAN1_RX    = 51u,              ///< function set to can rx of ch.1
    AMHW_HC32F460_AFIO_I2S1_SD    = 52u,              ///< function set to i2s sd of ch.1
    AMHW_HC32F460_AFIO_I2S3_SD    = 52u,              ///< function set to i2s sd of ch.3
    AMHW_HC32F460_AFIO_I2S1_SDIN  = 53u,              ///< function set to i2s sdin of ch.1
    AMHW_HC32F460_AFIO_I2S3_SDIN  = 53u,              ///< function set to i2s sdin of ch.3
    AMHW_HC32F460_AFIO_I2S1_WS    = 54u,              ///< function set to i2s ws of ch.1
    AMHW_HC32F460_AFIO_I2S3_WS    = 54u,              ///< function set to i2s ws of ch.3
    AMHW_HC32F460_AFIO_I2S1_CK    = 55u,              ///< function set to i2s ck of ch.1
    AMHW_HC32F460_AFIO_I2S3_CK    = 55u,              ///< function set to i2s ck of ch.3
    AMHW_HC32F460_AFIO_I2S2_SD    = 56u,              ///< function set to i2s sd of ch.2
    AMHW_HC32F460_AFIO_I2S4_SD    = 56u,              ///< function set to i2s sd of ch.4
    AMHW_HC32F460_AFIO_I2S2_SDIN  = 57u,              ///< function set to i2s sdin of ch.2
    AMHW_HC32F460_AFIO_I2S4_SDIN  = 57u,              ///< function set to i2s sdin of ch.4
    AMHW_HC32F460_AFIO_I2S2_WS    = 58u,              ///< function set to i2s ws of ch.2
    AMHW_HC32F460_AFIO_I2S4_WS    = 58u,              ///< function set to i2s ws of ch.4
    AMHW_HC32F460_AFIO_I2S2_CK    = 59u,              ///< function set to i2s ck of ch.2
    AMHW_HC32F460_AFIO_I2S4_CK    = 59u,              ///< function set to i2s ck of ch.4
}amhw_hc32f460_gpio_afio_t;

typedef struct
{
    __IO uint16_t PIN00                     : 1;
    __IO uint16_t PIN01                     : 1;
    __IO uint16_t PIN02                     : 1;
    __IO uint16_t PIN03                     : 1;
    __IO uint16_t PIN04                     : 1;
    __IO uint16_t PIN05                     : 1;
    __IO uint16_t PIN06                     : 1;
    __IO uint16_t PIN07                     : 1;
    __IO uint16_t PIN08                     : 1;
    __IO uint16_t PIN09                     : 1;
    __IO uint16_t PIN10                     : 1;
    __IO uint16_t PIN11                     : 1;
    __IO uint16_t PIN12                     : 1;
    __IO uint16_t PIN13                     : 1;
    __IO uint16_t PIN14                     : 1;
    __IO uint16_t PIN15                     : 1;
} amhw_hc32f460_port_pidr_field_t;

typedef struct
{
    __IO uint16_t POUT00                    : 1;
    __IO uint16_t POUT01                    : 1;
    __IO uint16_t POUT02                    : 1;
    __IO uint16_t POUT03                    : 1;
    __IO uint16_t POUT04                    : 1;
    __IO uint16_t POUT05                    : 1;
    __IO uint16_t POUT06                    : 1;
    __IO uint16_t POUT07                    : 1;
    __IO uint16_t POUT08                    : 1;
    __IO uint16_t POUT09                    : 1;
    __IO uint16_t POUT10                    : 1;
    __IO uint16_t POUT11                    : 1;
    __IO uint16_t POUT12                    : 1;
    __IO uint16_t POUT13                    : 1;
    __IO uint16_t POUT14                    : 1;
    __IO uint16_t POUT15                    : 1;
} amhw_hc32f460_port_podr_field_t;

typedef struct
{
    __IO uint16_t POUTE00                   : 1;
    __IO uint16_t POUTE01                   : 1;
    __IO uint16_t POUTE02                   : 1;
    __IO uint16_t POUTE03                   : 1;
    __IO uint16_t POUTE04                   : 1;
    __IO uint16_t POUTE05                   : 1;
    __IO uint16_t POUTE06                   : 1;
    __IO uint16_t POUTE07                   : 1;
    __IO uint16_t POUTE08                   : 1;
    __IO uint16_t POUTE09                   : 1;
    __IO uint16_t POUTE10                   : 1;
    __IO uint16_t POUTE11                   : 1;
    __IO uint16_t POUTE12                   : 1;
    __IO uint16_t POUTE13                   : 1;
    __IO uint16_t POUTE14                   : 1;
    __IO uint16_t POUTE15                   : 1;
} amhw_hc32f460_port_poer_field_t;
typedef struct
{
    __IO uint16_t POS00                     : 1;
    __IO uint16_t POS01                     : 1;
    __IO uint16_t POS02                     : 1;
    __IO uint16_t POS03                     : 1;
    __IO uint16_t POS04                     : 1;
    __IO uint16_t POS05                     : 1;
    __IO uint16_t POS06                     : 1;
    __IO uint16_t POS07                     : 1;
    __IO uint16_t POS08                     : 1;
    __IO uint16_t POS09                     : 1;
    __IO uint16_t POS10                     : 1;
    __IO uint16_t POS11                     : 1;
    __IO uint16_t POS12                     : 1;
    __IO uint16_t POS13                     : 1;
    __IO uint16_t POS14                     : 1;
    __IO uint16_t POS15                     : 1;
} amhw_hc32f460_port_posr_field_t;

typedef struct
{
    __IO uint16_t POR00                     : 1;
    __IO uint16_t POR01                     : 1;
    __IO uint16_t POR02                     : 1;
    __IO uint16_t POR03                     : 1;
    __IO uint16_t POR04                     : 1;
    __IO uint16_t POR05                     : 1;
    __IO uint16_t POR06                     : 1;
    __IO uint16_t POR07                     : 1;
    __IO uint16_t POR08                     : 1;
    __IO uint16_t POR09                     : 1;
    __IO uint16_t POR10                     : 1;
    __IO uint16_t POR11                     : 1;
    __IO uint16_t POR12                     : 1;
    __IO uint16_t POR13                     : 1;
    __IO uint16_t POR14                     : 1;
    __IO uint16_t POR15                     : 1;
} amhw_hc32f460_port_porr_field_t;

typedef struct
{
    __IO uint16_t POT00                     : 1;
    __IO uint16_t POT01                     : 1;
    __IO uint16_t POT02                     : 1;
    __IO uint16_t POT03                     : 1;
    __IO uint16_t POT04                     : 1;
    __IO uint16_t POT05                     : 1;
    __IO uint16_t POT06                     : 1;
    __IO uint16_t POT07                     : 1;
    __IO uint16_t POT08                     : 1;
    __IO uint16_t POT09                     : 1;
    __IO uint16_t POT10                     : 1;
    __IO uint16_t POT11                     : 1;
    __IO uint16_t POT12                     : 1;
    __IO uint16_t POT13                     : 1;
    __IO uint16_t POT14                     : 1;
    __IO uint16_t POT15                     : 1;
} amhw_hc32f460_port_potr_field_t;

typedef struct
{
    __IO uint16_t PIN00                     : 1;
    __IO uint16_t PIN01                     : 1;
    __IO uint16_t PIN02                     : 1;
    uint16_t RESERVED3                      :13;
} amhw_hc32f460_port_pidrh_field_t;

typedef struct
{
    __IO uint16_t POUT00                    : 1;
    __IO uint16_t POUT01                    : 1;
    __IO uint16_t POUT02                    : 1;
    uint16_t RESERVED3                      :13;
} amhw_hc32f460_port_podrh_field_t;

typedef struct
{
    __IO uint16_t POUTE00                   : 1;
    __IO uint16_t POUTE01                   : 1;
    __IO uint16_t POUTE02                   : 1;
    uint16_t RESERVED3                      :13;
} AMHW_HC32F460_port_poerh_field_t;

typedef struct
{
    __IO uint16_t POS00                     : 1;
    __IO uint16_t POS01                     : 1;
    __IO uint16_t POS02                     : 1;
    uint16_t RESERVED3                      :13;
} amhw_hc32f460_port_posrh_field_t;

typedef struct
{
    __IO uint16_t POR00                     : 1;
    __IO uint16_t POR01                     : 1;
    __IO uint16_t POR02                     : 1;
    uint16_t RESERVED3                      :13;
} amhw_hc32f460_port_porrh_field_t;

typedef struct
{
    __IO uint16_t POT00                     : 1;
    __IO uint16_t POT01                     : 1;
    __IO uint16_t POT02                     : 1;
    uint16_t RESERVED3                      :13;
} amhw_hc32f460_port_potrh_field_t;

typedef struct
{
    __IO uint16_t SPFE                      : 5;
    uint16_t RESERVED5                      :11;
} amhw_hc32f460_port_pspcr_field_t;

typedef struct
{
    __IO uint16_t BFSEL                     : 4;
    uint16_t RESERVED4                      :10;
    __IO uint16_t RDWT                      : 2;
} amhw_hc32f460_port_pccr_field_t;

typedef struct
{
    __IO uint16_t PINAE                     : 6;
    uint16_t RESERVED6                      :10;
} amhw_hc32f460_port_pinaer_field_t;

typedef struct
{
    __IO uint16_t WE                        : 1;
    uint16_t RESERVED1                      : 7;
    __IO uint16_t WP                        : 8;
} amhw_hc32f460_port_pwpr_field;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 1;
    __IO uint16_t LTE                       : 1;
    __IO uint16_t DDIS                      : 1;
} amhw_hc32f460_port_pcr_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 6;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t BFE                       : 1;
    uint16_t RESERVED9                      : 7;
} amhw_hc32f460_port_pfsr_field_t;

