zlgopen/ametal/soc/hdsc/drivers/include/gpio/hw/amhw_hc32f460_gpio.h
/**
 * \brief GPIO 寄存器块结构体
 */
typedef struct amhw_hc32f460_gpio {
    union
    {
        __IO uint16_t PIDRA;
        amhw_hc32f460_port_pidr_field_t PIDRA_f;
    };
    uint8_t RESERVED1[2];
    union
    {
        __IO uint16_t PODRA;
        amhw_hc32f460_port_podr_field_t PODRA_f;
    };
    union
    {
        __IO uint16_t POERA;
        amhw_hc32f460_port_poer_field_t POERA_f;
    };
    union
    {
        __IO uint16_t POSRA;
        amhw_hc32f460_port_posr_field_t POSRA_f;
    };
    union
    {
        __IO uint16_t PORRA;
        amhw_hc32f460_port_porr_field_t PORRA_f;
    };
    union
    {
        __IO uint16_t POTRA;
        amhw_hc32f460_port_potr_field_t POTRA_f;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint16_t PIDRB;
        amhw_hc32f460_port_pidr_field_t PIDRB_f;
    };
    uint8_t RESERVED7[2];
    union
    {
        __IO uint16_t PODRB;
        amhw_hc32f460_port_podr_field_t PODRB_f;
    };
    union
    {
        __IO uint16_t POERB;
        amhw_hc32f460_port_poer_field_t POERB_f;
    };
    union
    {
        __IO uint16_t POSRB;
        amhw_hc32f460_port_posr_field_t POSRB_f;
    };
    union
    {
        __IO uint16_t PORRB;
        amhw_hc32f460_port_porr_field_t PORRB_f;
    };
    union
    {
        __IO uint16_t POTRB;
        amhw_hc32f460_port_potr_field_t POTRB_f;
    };
    uint8_t RESERVED12[2];
    union
    {
        __IO uint16_t PIDRC;
        amhw_hc32f460_port_pidr_field_t PIDRC_f;
    };
    uint8_t RESERVED13[2];
    union
    {
        __IO uint16_t PODRC;
        amhw_hc32f460_port_podr_field_t PODRC_f;
    };
    union
    {
        __IO uint16_t POERC;
        amhw_hc32f460_port_poer_field_t POERC_f;
    };
    union
    {
        __IO uint16_t POSRC;
        amhw_hc32f460_port_posr_field_t POSRC_f;
    };
    union
    {
        __IO uint16_t PORRC;
        amhw_hc32f460_port_porr_field_t PORRC_f;
    };
    union
    {
        __IO uint16_t POTRC;
        amhw_hc32f460_port_potr_field_t POTRC_f;
    };
    uint8_t RESERVED18[2];
    union
    {
        __IO uint16_t PIDRD;
        amhw_hc32f460_port_pidr_field_t PIDRD_f;
    };
    uint8_t RESERVED19[2];
    union
    {
        __IO uint16_t PODRD;
        amhw_hc32f460_port_podr_field_t PODRD_f;
    };
    union
    {
        __IO uint16_t POERD;
        amhw_hc32f460_port_poer_field_t POERD_f;
    };
    union
    {
        __IO uint16_t POSRD;
        amhw_hc32f460_port_posr_field_t POSRD_f;
    };
    union
    {
        __IO uint16_t PORRD;
        amhw_hc32f460_port_porr_field_t PORRD_f;
    };
    union
    {
        __IO uint16_t POTRD;
        amhw_hc32f460_port_potr_field_t POTRD_f;
    };
    uint8_t RESERVED24[2];
    union
    {
        __IO uint16_t PIDRE;
        amhw_hc32f460_port_pidr_field_t PIDRE_f;
    };
    uint8_t RESERVED25[2];
    union
    {
        __IO uint16_t PODRE;
        amhw_hc32f460_port_podr_field_t PODRE_f;
    };
    union
    {
        __IO uint16_t POERE;
        amhw_hc32f460_port_poer_field_t POERE_f;
    };
    union
    {
        __IO uint16_t POSRE;
        amhw_hc32f460_port_posr_field_t POSRE_f;
    };
    union
    {
        __IO uint16_t PORRE;
        amhw_hc32f460_port_porr_field_t PORRE_f;
    };
    union
    {
        __IO uint16_t POTRE;
        amhw_hc32f460_port_potr_field_t POTRE_f;
    };
    uint8_t RESERVED30[2];
    union
    {
        __IO uint16_t PIDRH;
        amhw_hc32f460_port_pidrh_field_t PIDRH_f;
    };
    uint8_t RESERVED31[2];
    union
    {
        __IO uint16_t PODRH;
        amhw_hc32f460_port_podrh_field_t PODRH_f;
    };
    union
    {
        __IO uint16_t POERH;
        AMHW_HC32F460_port_poerh_field_t POERH_f;
    };
    union
    {
        __IO uint16_t POSRH;
        amhw_hc32f460_port_posrh_field_t POSRH_f;
    };
    union
    {
        __IO uint16_t PORRH;
        amhw_hc32f460_port_porrh_field_t PORRH_f;
    };
    union
    {
        __IO uint16_t POTRH;
        amhw_hc32f460_port_potrh_field_t POTRH_f;
    };
    uint8_t RESERVED36[918];
    union
    {
        __IO uint16_t PSPCR;
        amhw_hc32f460_port_pspcr_field_t PSPCR_f;
    };
    uint8_t RESERVED37[2];
    union
    {
        __IO uint16_t PCCR;
        amhw_hc32f460_port_pccr_field_t PCCR_f;
    };
    union
    {
        __IO uint16_t PINAER;
        amhw_hc32f460_port_pinaer_field_t PINAER_f;
    };
    union
    {
        __IO uint16_t PWPR;
        amhw_hc32f460_port_pwpr_field PWPR_f;
    };
    uint8_t RESERVED40[2];
    union
    {
        __IO uint16_t PCRA0;
        amhw_hc32f460_port_pcr_field_t PCRA0_f;
    };
    union
    {
        __IO uint16_t PFSRA0;
        amhw_hc32f460_port_pfsr_field_t PFSRA0_f;
    };
    union
    {
        __IO uint16_t PCRA1;
        amhw_hc32f460_port_pcr_field_t PCRA1_f;
    };
    union
    {
        __IO uint16_t PFSRA1;
        amhw_hc32f460_port_pfsr_field_t PFSRA1_f;
    };
    union
    {
        __IO uint16_t PCRA2;
        amhw_hc32f460_port_pcr_field_t PCRA2_f;
    };
    union
    {
        __IO uint16_t PFSRA2;
        amhw_hc32f460_port_pfsr_field_t PFSRA2_f;
    };
    union
    {
        __IO uint16_t PCRA3;
        amhw_hc32f460_port_pcr_field_t PCRA3_f;
    };
    union
    {
        __IO uint16_t PFSRA3;
        amhw_hc32f460_port_pfsr_field_t PFSRA3_f;
    };
    union
    {
        __IO uint16_t PCRA4;
        amhw_hc32f460_port_pcr_field_t PCRA4_f;
    };
    union
    {
        __IO uint16_t PFSRA4;
        amhw_hc32f460_port_pfsr_field_t PFSRA4_f;
    };
    union
    {
        __IO uint16_t PCRA5;
        amhw_hc32f460_port_pcr_field_t PCRA5_f;
    };
    union
    {
        __IO uint16_t PFSRA5;
        amhw_hc32f460_port_pfsr_field_t PFSRA5_f;
    };
    union
    {
        __IO uint16_t PCRA6;
        amhw_hc32f460_port_pcr_field_t PCRA6_f;
    };
    union
    {
        __IO uint16_t PFSRA6;
        amhw_hc32f460_port_pfsr_field_t PFSRA6_f;
    };
    union
    {
        __IO uint16_t PCRA7;
        amhw_hc32f460_port_pcr_field_t PCRA7_f;
    };
    union
    {
        __IO uint16_t PFSRA7;
        amhw_hc32f460_port_pfsr_field_t PFSRA7_f;
    };
    union
    {
        __IO uint16_t PCRA8;
        amhw_hc32f460_port_pcr_field_t PCRA8_f;
    };
    union
    {
        __IO uint16_t PFSRA8;
        amhw_hc32f460_port_pfsr_field_t PFSRA8_f;
    };
    union
    {
        __IO uint16_t PCRA9;
        amhw_hc32f460_port_pcr_field_t PCRA9_f;
    };
    union
    {
        __IO uint16_t PFSRA9;
        amhw_hc32f460_port_pfsr_field_t PFSRA9_f;
    };
    union
    {
        __IO uint16_t PCRA10;
        amhw_hc32f460_port_pcr_field_t PCRA10_f;
    };
    union
    {
        __IO uint16_t PFSRA10;
        amhw_hc32f460_port_pfsr_field_t PFSRA10_f;
    };
    union
    {
        __IO uint16_t PCRA11;
        amhw_hc32f460_port_pcr_field_t PCRA11_f;
    };
    union
    {
        __IO uint16_t PFSRA11;
        amhw_hc32f460_port_pfsr_field_t PFSRA11_f;
    };
    union
    {
        __IO uint16_t PCRA12;
        amhw_hc32f460_port_pcr_field_t PCRA12_f;
    };
    union
    {
        __IO uint16_t PFSRA12;
        amhw_hc32f460_port_pfsr_field_t PFSRA12_f;
    };
    union
    {
        __IO uint16_t PCRA13;
        amhw_hc32f460_port_pcr_field_t PCRA13_f;
    };
    union
    {
        __IO uint16_t PFSRA13;
        amhw_hc32f460_port_pfsr_field_t PFSRA13_f;
    };
    union
    {
        __IO uint16_t PCRA14;
        amhw_hc32f460_port_pcr_field_t PCRA14_f;
    };
    union
    {
        __IO uint16_t PFSRA14;
        amhw_hc32f460_port_pfsr_field_t PFSRA14_f;
    };
    union
    {
        __IO uint16_t PCRA15;
        amhw_hc32f460_port_pcr_field_t PCRA15_f;
    };
    union
    {
        __IO uint16_t PFSRA15;
        amhw_hc32f460_port_pfsr_field_t PFSRA15_f;
    };
    union
    {
        __IO uint16_t PCRB0;
        amhw_hc32f460_port_pcr_field_t PCRB0_f;
    };
    union
    {
        __IO uint16_t PFSRB0;
        amhw_hc32f460_port_pfsr_field_t PFSRB0_f;
    };
    union
    {
        __IO uint16_t PCRB1;
        amhw_hc32f460_port_pcr_field_t PCRB1_f;
    };
    union
    {
        __IO uint16_t PFSRB1;
        amhw_hc32f460_port_pfsr_field_t PFSRB1_f;
    };
    union
    {
        __IO uint16_t PCRB2;
        amhw_hc32f460_port_pcr_field_t PCRB2_f;
    };
    union
    {
        __IO uint16_t PFSRB2;
        amhw_hc32f460_port_pfsr_field_t PFSRB2_f;
    };
    union
    {
        __IO uint16_t PCRB3;
        amhw_hc32f460_port_pcr_field_t PCRB3_f;
    };
    union
    {
        __IO uint16_t PFSRB3;
        amhw_hc32f460_port_pfsr_field_t PFSRB3_f;
    };
    union
    {
        __IO uint16_t PCRB4;
        amhw_hc32f460_port_pcr_field_t PCRB4_f;
    };
    union
    {
        __IO uint16_t PFSRB4;
        amhw_hc32f460_port_pfsr_field_t PFSRB4_f;
    };
    union
    {
        __IO uint16_t PCRB5;
        amhw_hc32f460_port_pcr_field_t PCRB5_f;
    };
    union
    {
        __IO uint16_t PFSRB5;
        amhw_hc32f460_port_pfsr_field_t PFSRB5_f;
    };
    union
    {
        __IO uint16_t PCRB6;
        amhw_hc32f460_port_pcr_field_t PCRB6_f;
    };
    union
    {
        __IO uint16_t PFSRB6;
        amhw_hc32f460_port_pfsr_field_t PFSRB6_f;
    };
    union
    {
        __IO uint16_t PCRB7;
        amhw_hc32f460_port_pcr_field_t PCRB7_f;
    };
    union
    {
        __IO uint16_t PFSRB7;
        amhw_hc32f460_port_pfsr_field_t PFSRB7_f;
    };
    union
    {
        __IO uint16_t PCRB8;
        amhw_hc32f460_port_pcr_field_t PCRB8_f;
    };
    union
    {
        __IO uint16_t PFSRB8;
        amhw_hc32f460_port_pfsr_field_t PFSRB8_f;
    };
    union
    {
        __IO uint16_t PCRB9;
        amhw_hc32f460_port_pcr_field_t PCRB9_f;
    };
    union
    {
        __IO uint16_t PFSRB9;
        amhw_hc32f460_port_pfsr_field_t PFSRB9_f;
    };
    union
    {
        __IO uint16_t PCRB10;
        amhw_hc32f460_port_pcr_field_t PCRB10_f;
    };
    union
    {
        __IO uint16_t PFSRB10;
        amhw_hc32f460_port_pfsr_field_t PFSRB10_f;
    };
    union
    {
        __IO uint16_t PCRB11;
        amhw_hc32f460_port_pcr_field_t PCRB11_f;
    };
    union
    {
        __IO uint16_t PFSRB11;
        amhw_hc32f460_port_pfsr_field_t PFSRB11_f;
    };
    union
    {
        __IO uint16_t PCRB12;
        amhw_hc32f460_port_pcr_field_t PCRB12_f;
    };
    union
    {
        __IO uint16_t PFSRB12;
        amhw_hc32f460_port_pfsr_field_t PFSRB12_f;
    };
    union
    {
        __IO uint16_t PCRB13;
        amhw_hc32f460_port_pcr_field_t PCRB13_f;
    };
    union
    {
        __IO uint16_t PFSRB13;
        amhw_hc32f460_port_pfsr_field_t PFSRB13_f;
    };
    union
    {
        __IO uint16_t PCRB14;
        amhw_hc32f460_port_pcr_field_t PCRB14_f;
    };
    union
    {
        __IO uint16_t PFSRB14;
        amhw_hc32f460_port_pfsr_field_t PFSRB14_f;
    };
    union
    {
        __IO uint16_t PCRB15;
        amhw_hc32f460_port_pcr_field_t PCRB15_f;
    };
    union
    {
        __IO uint16_t PFSRB15;
        amhw_hc32f460_port_pfsr_field_t PFSRB15_f;
    };
    union
    {
        __IO uint16_t PCRC0;
        amhw_hc32f460_port_pcr_field_t PCRC0_f;
    };
    union
    {
        __IO uint16_t PFSRC0;
        amhw_hc32f460_port_pfsr_field_t PFSRC0_f;
    };
    union
    {
        __IO uint16_t PCRC1;
        amhw_hc32f460_port_pcr_field_t PCRC1_f;
    };
    union
    {
        __IO uint16_t PFSRC1;
        amhw_hc32f460_port_pfsr_field_t PFSRC1_f;
    };
    union
    {
        __IO uint16_t PCRC2;
        amhw_hc32f460_port_pcr_field_t PCRC2_f;
    };
    union
    {
        __IO uint16_t PFSRC2;
        amhw_hc32f460_port_pfsr_field_t PFSRC2_f;
    };
    union
    {
        __IO uint16_t PCRC3;
        amhw_hc32f460_port_pcr_field_t PCRC3_f;
    };
    union
    {
        __IO uint16_t PFSRC3;
        amhw_hc32f460_port_pfsr_field_t PFSRC3_f;
    };
    union
    {
        __IO uint16_t PCRC4;
        amhw_hc32f460_port_pcr_field_t PCRC4_f;
    };
    union
    {
        __IO uint16_t PFSRC4;
        amhw_hc32f460_port_pfsr_field_t PFSRC4_f;
    };
    union
    {
        __IO uint16_t PCRC5;
        amhw_hc32f460_port_pcr_field_t PCRC5_f;
    };
    union
    {
        __IO uint16_t PFSRC5;
        amhw_hc32f460_port_pfsr_field_t PFSRC5_f;
    };
    union
    {
        __IO uint16_t PCRC6;
        amhw_hc32f460_port_pcr_field_t PCRC6_f;
    };
    union
    {
        __IO uint16_t PFSRC6;
        amhw_hc32f460_port_pfsr_field_t PFSRC6_f;
    };
    union
    {
        __IO uint16_t PCRC7;
        amhw_hc32f460_port_pcr_field_t PCRC7_f;
    };
    union
    {
        __IO uint16_t PFSRC7;
        amhw_hc32f460_port_pfsr_field_t PFSRC7_f;
    };
    union
    {
        __IO uint16_t PCRC8;
        amhw_hc32f460_port_pcr_field_t PCRC8_f;
    };
    union
    {
        __IO uint16_t PFSRC8;
        amhw_hc32f460_port_pfsr_field_t PFSRC8_f;
    };
    union
    {
        __IO uint16_t PCRC9;
        amhw_hc32f460_port_pcr_field_t PCRC9_f;
    };
    union
    {
        __IO uint16_t PFSRC9;
        amhw_hc32f460_port_pfsr_field_t PFSRC9_f;
    };
    union
    {
        __IO uint16_t PCRC10;
        amhw_hc32f460_port_pcr_field_t PCRC10_f;
    };
    union
    {
        __IO uint16_t PFSRC10;
        amhw_hc32f460_port_pfsr_field_t PFSRC10_f;
    };
    union
    {
        __IO uint16_t PCRC11;
        amhw_hc32f460_port_pcr_field_t PCRC11_f;
    };
    union
    {
        __IO uint16_t PFSRC11;
        amhw_hc32f460_port_pfsr_field_t PFSRC11_f;
    };
    union
    {
        __IO uint16_t PCRC12;
        amhw_hc32f460_port_pcr_field_t PCRC12_f;
    };
    union
    {
        __IO uint16_t PFSRC12;
        amhw_hc32f460_port_pfsr_field_t PFSRC12_f;
    };
    union
    {
        __IO uint16_t PCRC13;
        amhw_hc32f460_port_pcr_field_t PCRC13_f;
    };
    union
    {
        __IO uint16_t PFSRC13;
        amhw_hc32f460_port_pfsr_field_t PFSRC13_f;
    };
    union
    {
        __IO uint16_t PCRC14;
        amhw_hc32f460_port_pcr_field_t PCRC14_f;
    };
    union
    {
        __IO uint16_t PFSRC14;
        amhw_hc32f460_port_pfsr_field_t PFSRC14_f;
    };
    union
    {
        __IO uint16_t PCRC15;
        amhw_hc32f460_port_pcr_field_t PCRC15_f;
    };
    union
    {
        __IO uint16_t PFSRC15;
        amhw_hc32f460_port_pfsr_field_t PFSRC15_f;
    };
    union
    {
        __IO uint16_t PCRD0;
        amhw_hc32f460_port_pcr_field_t PCRD0_f;
    };
    union
    {
        __IO uint16_t PFSRD0;
        amhw_hc32f460_port_pfsr_field_t PFSRD0_f;
    };
    union
    {
        __IO uint16_t PCRD1;
        amhw_hc32f460_port_pcr_field_t PCRD1_f;
    };
    union
    {
        __IO uint16_t PFSRD1;
        amhw_hc32f460_port_pfsr_field_t PFSRD1_f;
    };
    union
    {
        __IO uint16_t PCRD2;
        amhw_hc32f460_port_pcr_field_t PCRD2_f;
    };
    union
    {
        __IO uint16_t PFSRD2;
        amhw_hc32f460_port_pfsr_field_t PFSRD2_f;
    };
    union
    {
        __IO uint16_t PCRD3;
        amhw_hc32f460_port_pcr_field_t PCRD3_f;
    };
    union
    {
        __IO uint16_t PFSRD3;
        amhw_hc32f460_port_pfsr_field_t PFSRD3_f;
    };
    union
    {
        __IO uint16_t PCRD4;
        amhw_hc32f460_port_pcr_field_t PCRD4_f;
    };
    union
    {
        __IO uint16_t PFSRD4;
        amhw_hc32f460_port_pfsr_field_t PFSRD4_f;
    };
    union
    {
        __IO uint16_t PCRD5;
        amhw_hc32f460_port_pcr_field_t PCRD5_f;
    };
    union
    {
        __IO uint16_t PFSRD5;
        amhw_hc32f460_port_pfsr_field_t PFSRD5_f;
    };
    union
    {
        __IO uint16_t PCRD6;
        amhw_hc32f460_port_pcr_field_t PCRD6_f;
    };
    union
    {
        __IO uint16_t PFSRD6;
        amhw_hc32f460_port_pfsr_field_t PFSRD6_f;
    };
    union
    {
        __IO uint16_t PCRD7;
        amhw_hc32f460_port_pcr_field_t PCRD7_f;
    };
    union
    {
        __IO uint16_t PFSRD7;
        amhw_hc32f460_port_pfsr_field_t PFSRD7_f;
    };
    union
    {
        __IO uint16_t PCRD8;
        amhw_hc32f460_port_pcr_field_t PCRD8_f;
    };
    union
    {
        __IO uint16_t PFSRD8;
        amhw_hc32f460_port_pfsr_field_t PFSRD8_f;
    };
    union
    {
        __IO uint16_t PCRD9;
        amhw_hc32f460_port_pcr_field_t PCRD9_f;
    };
    union
    {
        __IO uint16_t PFSRD9;
        amhw_hc32f460_port_pfsr_field_t PFSRD9_f;
    };
    union
    {
        __IO uint16_t PCRD10;
        amhw_hc32f460_port_pcr_field_t PCRD10_f;
    };
    union
    {
        __IO uint16_t PFSRD10;
        amhw_hc32f460_port_pfsr_field_t PFSRD10_f;
    };
    union
    {
        __IO uint16_t PCRD11;
        amhw_hc32f460_port_pcr_field_t PCRD11_f;
    };
    union
    {
        __IO uint16_t PFSRD11;
        amhw_hc32f460_port_pfsr_field_t PFSRD11_f;
    };
    union
    {
        __IO uint16_t PCRD12;
        amhw_hc32f460_port_pcr_field_t PCRD12_f;
    };
    union
    {
        __IO uint16_t PFSRD12;
        amhw_hc32f460_port_pfsr_field_t PFSRD12_f;
    };
    union
    {
        __IO uint16_t PCRD13;
        amhw_hc32f460_port_pcr_field_t PCRD13_f;
    };
    union
    {
        __IO uint16_t PFSRD13;
        amhw_hc32f460_port_pfsr_field_t PFSRD13_f;
    };
    union
    {
        __IO uint16_t PCRD14;
        amhw_hc32f460_port_pcr_field_t PCRD14_f;
    };
    union
    {
        __IO uint16_t PFSRD14;
        amhw_hc32f460_port_pfsr_field_t PFSRD14_f;
    };
    union
    {
        __IO uint16_t PCRD15;
        amhw_hc32f460_port_pcr_field_t PCRD15_f;
    };
    union
    {
        __IO uint16_t PFSRD15;
        amhw_hc32f460_port_pfsr_field_t PFSRD15_f;
    };
    union
    {
        __IO uint16_t PCRE0;
        amhw_hc32f460_port_pcr_field_t PCRE0_f;
    };
    union
    {
        __IO uint16_t PFSRE0;
        amhw_hc32f460_port_pfsr_field_t PFSRE0_f;
    };
    union
    {
        __IO uint16_t PCRE1;
        amhw_hc32f460_port_pcr_field_t PCRE1_f;
    };
    union
    {
        __IO uint16_t PFSRE1;
        amhw_hc32f460_port_pfsr_field_t PFSRE1_f;
    };
    union
    {
        __IO uint16_t PCRE2;
        amhw_hc32f460_port_pcr_field_t PCRE2_f;
    };
    union
    {
        __IO uint16_t PFSRE2;
        amhw_hc32f460_port_pfsr_field_t PFSRE2_f;
    };
    union
    {
        __IO uint16_t PCRE3;
        amhw_hc32f460_port_pcr_field_t PCRE3_f;
    };
    union
    {
        __IO uint16_t PFSRE3;
        amhw_hc32f460_port_pfsr_field_t PFSRE3_f;
    };
    union
    {
        __IO uint16_t PCRE4;
        amhw_hc32f460_port_pcr_field_t PCRE4_f;
    };
    union
    {
        __IO uint16_t PFSRE4;
        amhw_hc32f460_port_pfsr_field_t PFSRE4_f;
    };
    union
    {
        __IO uint16_t PCRE5;
        amhw_hc32f460_port_pcr_field_t PCRE5_f;
    };
    union
    {
        __IO uint16_t PFSRE5;
        amhw_hc32f460_port_pfsr_field_t PFSRE5_f;
    };
    union
    {
        __IO uint16_t PCRE6;
        amhw_hc32f460_port_pcr_field_t PCRE6_f;
    };
    union
    {
        __IO uint16_t PFSRE6;
        amhw_hc32f460_port_pfsr_field_t PFSRE6_f;
    };
    union
    {
        __IO uint16_t PCRE7;
        amhw_hc32f460_port_pcr_field_t PCRE7_f;
    };
    union
    {
        __IO uint16_t PFSRE7;
        amhw_hc32f460_port_pfsr_field_t PFSRE7_f;
    };
    union
    {
        __IO uint16_t PCRE8;
        amhw_hc32f460_port_pcr_field_t PCRE8_f;
    };
    union
    {
        __IO uint16_t PFSRE8;
        amhw_hc32f460_port_pfsr_field_t PFSRE8_f;
    };
    union
    {
        __IO uint16_t PCRE9;
        amhw_hc32f460_port_pcr_field_t PCRE9_f;
    };
    union
    {
        __IO uint16_t PFSRE9;
        amhw_hc32f460_port_pfsr_field_t PFSRE9_f;
    };
    union
    {
        __IO uint16_t PCRE10;
        amhw_hc32f460_port_pcr_field_t PCRE10_f;
    };
    union
    {
        __IO uint16_t PFSRE10;
        amhw_hc32f460_port_pfsr_field_t PFSRE10_f;
    };
    union
    {
        __IO uint16_t PCRE11;
        amhw_hc32f460_port_pcr_field_t PCRE11_f;
    };
    union
    {
        __IO uint16_t PFSRE11;
        amhw_hc32f460_port_pfsr_field_t PFSRE11_f;
    };
    union
    {
        __IO uint16_t PCRE12;
        amhw_hc32f460_port_pcr_field_t PCRE12_f;
    };
    union
    {
        __IO uint16_t PFSRE12;
        amhw_hc32f460_port_pfsr_field_t PFSRE12_f;
    };
    union
    {
        __IO uint16_t PCRE13;
        amhw_hc32f460_port_pcr_field_t PCRE13_f;
    };
    union
    {
        __IO uint16_t PFSRE13;
        amhw_hc32f460_port_pfsr_field_t PFSRE13_f;
    };
    union
    {
        __IO uint16_t PCRE14;
        amhw_hc32f460_port_pcr_field_t PCRE14_f;
    };
    union
    {
        __IO uint16_t PFSRE14;
        amhw_hc32f460_port_pfsr_field_t PFSRE14_f;
    };
    union
    {
        __IO uint16_t PCRE15;
        amhw_hc32f460_port_pcr_field_t PCRE15_f;
    };
    union
    {
        __IO uint16_t PFSRE15;
        amhw_hc32f460_port_pfsr_field_t PFSRE15_f;
    };
    union
    {
        __IO uint16_t PCRH0;
        amhw_hc32f460_port_pcr_field_t PCRH0_f;
    };
    union
    {
        __IO uint16_t PFSRH0;
        amhw_hc32f460_port_pfsr_field_t PFSRH0_f;
    };
    union
    {
        __IO uint16_t PCRH1;
        amhw_hc32f460_port_pcr_field_t PCRH1_f;
    };
    union
    {
        __IO uint16_t PFSRH1;
        amhw_hc32f460_port_pfsr_field_t PFSRH1_f;
    };
    union
    {
        __IO uint16_t PCRH2;
        amhw_hc32f460_port_pcr_field_t PCRH2_f;
    };
    union
    {
        __IO uint16_t PFSRH2;
        amhw_hc32f460_port_pfsr_field_t PFSRH2_f;
    };
} amhw_hc32f460_gpio_t;

am_static_inline
void amhw_hc32f460_port_unlock(amhw_hc32f460_gpio_t *p_hw_gpio)
{
    p_hw_gpio->PWPR = 0xA501u;
}

am_static_inline
void amhw_hc32f460_port_lock(amhw_hc32f460_gpio_t *p_hw_gpio)
{
    p_hw_gpio->PWPR = 0xA500u;
}


am_static_inline
int amhw_hc32f460_gpio_pin_dir_get (amhw_hc32f460_gpio_t *p_hw_gpio, int pin);

am_static_inline
void __pin_calc (int pin, en_portx_t *p_port, uint8_t *p_pin_pos)
{
    if ((NULL != p_port) && (NULL != p_pin_pos))
    {
        *p_port    = (en_portx_t)(pin >> 4); 
        *p_pin_pos = (pin & 0x0F);
    }
}

/**
 * \brief 设置GPIO引脚为数字端口
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] pin       : 引脚编号,值为 PIO* (#PIOA_0)
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_gpio_pin_digital_set (amhw_hc32f460_gpio_t *p_hw_gpio, int pin)
{
    amhw_hc32f460_port_pcr_field_t *PCRx;
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    uint8_t pin_pos = 0u;
    __pin_calc(pin, &en_portx, &pin_pos);
    
    amhw_hc32f460_port_unlock(p_hw_gpio);
    PCRx = (amhw_hc32f460_port_pcr_field_t *)((uint32_t)(&(p_hw_gpio->PCRA0)) +      \
                                      en_portx * 0x40ul + pin_pos * 0x04ul);
    PCRx->DDIS  = 0u;  
    amhw_hc32f460_port_lock(p_hw_gpio);
}

