zlgopen/ametal/soc/hdsc/drivers/include/gpio/hw/amhw_hc32f460_gpio.h
/**
 * \brief 设置GPIO引脚为模拟端口
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] pin       : 引脚编号,值为 PIO* (#PIOA_0)
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_gpio_pin_analog_set (amhw_hc32f460_gpio_t *p_hw_gpio, int pin)
{
    amhw_hc32f460_port_pcr_field_t *PCRx;
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    uint8_t pin_pos = 0u;
    __pin_calc(pin, &en_portx, &pin_pos);
    
    amhw_hc32f460_port_unlock(p_hw_gpio);
    PCRx = (amhw_hc32f460_port_pcr_field_t *)((uint32_t)(&(p_hw_gpio->PCRA0)) +      \
                                      en_portx * 0x40ul + pin_pos * 0x04ul);
    PCRx->DDIS  = 1u;  
    amhw_hc32f460_port_lock(p_hw_gpio);
}

/**
 * \brief 获取当前端口数字端口/模拟端口
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] pin       : 引脚编号,值为 PIO* (#PIOA_0)
 *
 * \retval 0 : 数字端口
 * \retval 1 : 模拟端口
 */
am_static_inline
int amhw_hc32f460_gpio_pin_analog_digital_get (amhw_hc32f460_gpio_t *p_hw_gpio, int pin)
{
    amhw_hc32f460_port_pcr_field_t *PCRx;
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    uint8_t pin_pos = 0u;
    uint8_t value = 0;
    __pin_calc(pin, &en_portx, &pin_pos);
    
    amhw_hc32f460_port_unlock(p_hw_gpio);
    PCRx = (amhw_hc32f460_port_pcr_field_t *)((uint32_t)(&(p_hw_gpio->PCRA0)) +      \
                                      en_portx * 0x40ul + pin_pos * 0x04ul);
    value = PCRx->DDIS;  
    amhw_hc32f460_port_lock(p_hw_gpio);
    return value;
}

/**
 * \brief 设置GPIO引脚为输出状态锁存 使能
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] pin       : 引脚编号,值为 PIO* (#PIOA_0)
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_gpio_pin_lte_enable (amhw_hc32f460_gpio_t *p_hw_gpio, int pin)
{
    amhw_hc32f460_port_pcr_field_t *PCRx;
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    uint8_t pin_pos = 0u;
    __pin_calc(pin, &en_portx, &pin_pos);
    
    amhw_hc32f460_port_unlock(p_hw_gpio);
    PCRx = (amhw_hc32f460_port_pcr_field_t *)((uint32_t)(&(p_hw_gpio->PCRA0)) +      \
                                      en_portx * 0x40ul + pin_pos * 0x04ul);
    PCRx->LTE= 1u;  
    amhw_hc32f460_port_lock(p_hw_gpio);
}

/**
 * \brief 设置GPIO引脚为输出状态锁存 禁能
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] pin       : 引脚编号,值为 PIO* (#PIOA_0)
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_gpio_pin_lte_disable (amhw_hc32f460_gpio_t *p_hw_gpio, int pin)
{
    amhw_hc32f460_port_pcr_field_t *PCRx;
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    uint8_t pin_pos = 0u;
    __pin_calc(pin, &en_portx, &pin_pos);
    
    amhw_hc32f460_port_unlock(p_hw_gpio);
    PCRx = (amhw_hc32f460_port_pcr_field_t *)((uint32_t)(&(p_hw_gpio->PCRA0)) +      \
                                      en_portx * 0x40ul + pin_pos * 0x04ul);
    PCRx->LTE= 0u;  
    amhw_hc32f460_port_lock(p_hw_gpio);
}

/**
 * \brief 外部中断使能配置寄存器    使能
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] pin       : 引脚编号,值为 PIO* (#PIOA_0)
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_gpio_pin_ext_int_enable (amhw_hc32f460_gpio_t *p_hw_gpio, int pin)
{
    amhw_hc32f460_port_pcr_field_t *PCRx;
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    uint8_t pin_pos = 0u;
    __pin_calc(pin, &en_portx, &pin_pos);
    
    amhw_hc32f460_port_unlock(p_hw_gpio);
    PCRx = (amhw_hc32f460_port_pcr_field_t *)((uint32_t)(&(p_hw_gpio->PCRA0)) +      \
                                      en_portx * 0x40ul + pin_pos * 0x04ul);
    PCRx->INTE  = 1u;  
    amhw_hc32f460_port_lock(p_hw_gpio);
}

/**
 * \brief 外部中断使能配置寄存器    禁能
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] pin       : 引脚编号,值为 PIO* (#PIOA_0)
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_gpio_pin_ext_int_disable (amhw_hc32f460_gpio_t *p_hw_gpio, int pin)
{
    amhw_hc32f460_port_pcr_field_t *PCRx;
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    uint8_t pin_pos = 0u;
    __pin_calc(pin, &en_portx, &pin_pos);
    
    amhw_hc32f460_port_unlock(p_hw_gpio);
    PCRx = (amhw_hc32f460_port_pcr_field_t *)((uint32_t)(&(p_hw_gpio->PCRA0)) +      \
                                      en_portx * 0x40ul + pin_pos * 0x04ul);
    PCRx->INTE  = 0u;  
    amhw_hc32f460_port_lock(p_hw_gpio);
}

am_static_inline
int amhw_hc32f460_gpio_pin_get (amhw_hc32f460_gpio_t *p_hw_gpio, int pin)
{
    uint8_t pin_pos = 0u;
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    amhw_hc32f460_port_pcr_field_t *PCRx;

    __pin_calc(pin, &en_portx, &pin_pos);
    
    amhw_hc32f460_port_unlock(p_hw_gpio);
    PCRx = (amhw_hc32f460_port_pcr_field_t *)((uint32_t)(&(p_hw_gpio->PCRA0)) +      \
                                                    en_portx * 0x40ul + pin_pos * 0x04ul); 
    amhw_hc32f460_port_lock(p_hw_gpio);

    /* 当为推挽输出时，获取引脚的状态可以通过读取ODR寄存器的值来实现 */
    if (amhw_hc32f460_gpio_pin_dir_get(p_hw_gpio, pin) != 0) {
        return ((PCRx->POUT != 0) ? 1 : 0);
    } else {
        return ((PCRx->PIN != 0) ? 1 : 0);
    }
}

/**
 * \brief 上拉使能配置寄存器    使能
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] pin       : 引脚编号,值为 PIO* (#PIOA_0)
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_gpio_pin_pu_enable (amhw_hc32f460_gpio_t *p_hw_gpio, int pin)
{
    amhw_hc32f460_port_pcr_field_t *PCRx;
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    uint8_t pin_pos = 0u;
    __pin_calc(pin, &en_portx, &pin_pos);
    
    amhw_hc32f460_port_unlock(p_hw_gpio);
    PCRx = (amhw_hc32f460_port_pcr_field_t *)((uint32_t)(&(p_hw_gpio->PCRA0)) +      \
                                      en_portx * 0x40ul + pin_pos * 0x04ul);
    PCRx->PUU  = 1u;  
    amhw_hc32f460_port_lock(p_hw_gpio);
}

/**
 * \brief 上拉使能配置寄存器   禁能
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] pin       : 引脚编号,值为 PIO* (#PIOA_0)
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_gpio_pin_pu_disable (amhw_hc32f460_gpio_t *p_hw_gpio, int pin)
{
    amhw_hc32f460_port_pcr_field_t *PCRx;
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    uint8_t pin_pos = 0u;
    __pin_calc(pin, &en_portx, &pin_pos);
    
    amhw_hc32f460_port_unlock(p_hw_gpio);
    PCRx = (amhw_hc32f460_port_pcr_field_t *)((uint32_t)(&(p_hw_gpio->PCRA0)) +      \
                                      en_portx * 0x40ul + pin_pos * 0x04ul);
    PCRx->PUU  = 0u;  
    amhw_hc32f460_port_lock(p_hw_gpio);
}

/**
 * \brief 驱动能力配置寄存器  
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] pin       : 引脚编号,值为 PIO* (#PIOA_0)
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_gpio_pin_driver_capability  (amhw_hc32f460_gpio_t *p_hw_gpio, 
                                           amhw_hc32f460_gpio_speed_mode_t speed_mode,
                                           int pin
)
{
    amhw_hc32f460_port_pcr_field_t *PCRx;
    uint8_t pin_pos = 0u;
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    __pin_calc(pin, &en_portx, &pin_pos);
    amhw_hc32f460_port_unlock(p_hw_gpio);
    PCRx = (amhw_hc32f460_port_pcr_field_t *)((uint32_t)(&(p_hw_gpio->PCRA0)) +      \
                                                en_portx * 0x40ul + pin_pos * 0x04ul); 
    PCRx->DRV = speed_mode;
    amhw_hc32f460_port_lock(p_hw_gpio);
}

/**
 * \brief 设置GPIO引脚方向为输出
 *
 * \param[in] p_hw_gpio  : 指向GPIO寄存器块的指针
 * \param[in] pin        : 引脚编号，值为 PIO* (#PIOA_0)
 * \param[in] speed_mode : 引脚为输现时，其驱动电路响应速度模式，
 *                         值为 amhw_hc32f460_gpio_speed_mode_t 这个枚举类型
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_gpio_pin_dir_output (amhw_hc32f460_gpio_t           *p_hw_gpio,
                                   int                        pin)
{
    amhw_hc32f460_port_pcr_field_t *PCRx;
    uint8_t pin_pos = 0u;
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    __pin_calc(pin, &en_portx, &pin_pos);
    amhw_hc32f460_port_unlock(p_hw_gpio);
    PCRx = (amhw_hc32f460_port_pcr_field_t *)((uint32_t)(&(p_hw_gpio->PCRA0)) +      \
                                                en_portx * 0x40ul + pin_pos * 0x04ul); 
    PCRx->POUTE = 1;                                                
    amhw_hc32f460_port_lock(p_hw_gpio);
}

/**
 * \brief 设置GPIO引脚方向为输入
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] pin       : 引脚编号，值为 PIO* (#PIOA_0)
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_gpio_pin_dir_input (amhw_hc32f460_gpio_t *p_hw_gpio, int pin)
{
    /* 设置引脚方向为输出相关位段, 调用改接口不会影响其它位段 */
    amhw_hc32f460_port_pcr_field_t *PCRx;
    uint8_t pin_pos = 0u;
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    __pin_calc(pin, &en_portx, &pin_pos);
    amhw_hc32f460_port_unlock(p_hw_gpio);
    PCRx = (amhw_hc32f460_port_pcr_field_t *)((uint32_t)(&(p_hw_gpio->PCRA0)) +      \
                                            en_portx * 0x40ul + pin_pos * 0x04ul);                                                
    PCRx->POUTE = 0;
    amhw_hc32f460_port_lock(p_hw_gpio);
}

/**
 * \brief 获取GPIO引脚输入输出方向
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] pin       : 引脚编号，值为 PIO* (#PIOA_0)
 *
 * \retval  0  : 输入
 * \retval  1  : 输出
 */
am_static_inline
int amhw_hc32f460_gpio_pin_dir_get (amhw_hc32f460_gpio_t *p_hw_gpio, int pin)
{
    amhw_hc32f460_port_pcr_field_t *PCRx;
    uint8_t pin_pos = 0u;
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    
    __pin_calc(pin, &en_portx, &pin_pos);    
   
    amhw_hc32f460_port_unlock(p_hw_gpio);
    PCRx = (amhw_hc32f460_port_pcr_field_t *)((uint32_t)(&(p_hw_gpio->PCRA0)) +      \
                                                en_portx * 0x40ul + pin_pos * 0x04ul);                                                
    amhw_hc32f460_port_lock(p_hw_gpio);

    return ((PCRx->POUTE != 0) ? 1 : 0);
}


/**
 * \brief 开漏输出配置寄存器    使能
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] pin       : 引脚编号,值为 PIO* (#PIOA_0)
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_gpio_pin_od_enable (amhw_hc32f460_gpio_t *p_hw_gpio, int pin)
{
    amhw_hc32f460_port_pcr_field_t *PCRx;
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    uint8_t pin_pos = 0u;
    __pin_calc(pin, &en_portx, &pin_pos);
    
    amhw_hc32f460_port_unlock(p_hw_gpio);
    PCRx = (amhw_hc32f460_port_pcr_field_t *)((uint32_t)(&(p_hw_gpio->PCRA0)) +      \
                                      en_portx * 0x40ul + pin_pos * 0x04ul);
    PCRx->NOD  = 1u;  
    amhw_hc32f460_port_lock(p_hw_gpio);
}


/**
 * \brief 开漏输出配置寄存器   禁能
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] pin       : 引脚编号,值为 PIO* (#PIOA_0)
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_gpio_pin_od_disable (amhw_hc32f460_gpio_t *p_hw_gpio, int pin)
{
    amhw_hc32f460_port_pcr_field_t *PCRx;
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    uint8_t pin_pos = 0u;
    __pin_calc(pin, &en_portx, &pin_pos);
    
    amhw_hc32f460_port_unlock(p_hw_gpio);
    PCRx = (amhw_hc32f460_port_pcr_field_t *)((uint32_t)(&(p_hw_gpio->PCRA0)) +      \
                                      en_portx * 0x40ul + pin_pos * 0x04ul);
    PCRx->NOD  = 0u;  
    amhw_hc32f460_port_lock(p_hw_gpio);
}

/**
 * \brief 设置GPIO引脚输出高电平
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] pin       : 引脚编号，值为 PIO* (#PIOA_0)
 *
 * \return 无.
 *
 * \note 该功能配置输入引脚的时候为使能上拉电阻并失能下拉电阻
 */
am_static_inline
void amhw_hc32f460_gpio_pin_out_high (amhw_hc32f460_gpio_t *p_hw_gpio, int pin)
{
    uint32_t *POSRx;
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    uint8_t   pin_pos = 0u;
    __pin_calc(pin, &en_portx, &pin_pos);

    POSRx = (uint32_t *)((uint32_t)(&(p_hw_gpio->POSRA)) + 0x10 * en_portx);
    *POSRx |= (1 << pin_pos) & 0x0000FFFFul;
}

/**
 * \brief 设置GPIO引脚输出低电平
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] pin       : 引脚编号，值为 PIO* (#PIOA_0)
 *
 * \return 无
 *
 * \note 该功能配置输入引脚的时候为失能上拉电阻并使能下拉电阻
 */
am_static_inline
void amhw_hc32f460_gpio_pin_out_low (amhw_hc32f460_gpio_t *p_hw_gpio, int pin)
{
    uint32_t *PORRx;
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    uint8_t   pin_pos = 0u;
    __pin_calc(pin, &en_portx, &pin_pos);

    PORRx = (uint32_t *)((uint32_t)(&(p_hw_gpio->PORRA)) + 0x10 * en_portx);
    *PORRx |= (1 << pin_pos) & 0x0000FFFFul;
}

/**
 * \brief 翻转GPIO输出引脚的电平状态
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] pin       : 引脚编号，值为 PIO* (#PIOA_0)
 *
 * \return 无
 *
 * \note 该功能配置输入引脚的时候为配置上拉/下拉电阻
 */
am_static_inline
void amhw_hc32f460_gpio_pin_toggle (amhw_hc32f460_gpio_t *p_hw_gpio, int pin)
{
    uint32_t *POTRx;    
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    uint8_t   pin_pos = 0u;
    __pin_calc(pin, &en_portx, &pin_pos);
    
    POTRx = (uint32_t *)((uint32_t)(&(p_hw_gpio->POTRA)) + 0x10 * en_portx);
    *POTRx |= (1 << pin_pos) & 0x0000FFFFul;
}

/**
 * \brief 引脚复用功能重映射设置
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] gpio_af   : 引脚复用功能编号，值为 AMHW_GPIO_AF_* 这一类宏 (# AMHW_GPIO_AF_0)
 * \param[in] pin       : 引脚编号，值为 PIO* (#PIOA_0)
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_gpio_pin_afr_set (amhw_hc32f460_gpio_t *p_hw_gpio, int gpio_af, int pin)
{
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    uint8_t   pin_pos = 0u;
    amhw_hc32f460_gpio_afio_t enFuncSel;
    amhw_hc32f460_port_pfsr_field_t *PFSRx;

    __pin_calc(pin, &en_portx, &pin_pos);

    enFuncSel = (amhw_hc32f460_gpio_afio_t)gpio_af;

    amhw_hc32f460_port_unlock(p_hw_gpio);
    PFSRx = (amhw_hc32f460_port_pfsr_field_t *)((uint32_t)(&(p_hw_gpio->PFSRA0)) \
        + 0x40ul * en_portx + 0x4ul * pin_pos);

    /* main function setting */
    PFSRx->FSEL = enFuncSel & 0x0000003f;
    amhw_hc32f460_port_lock(p_hw_gpio);
}

/**
 * \brief 获取当前引脚复用功能码AF
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] pin       : 引脚编号，值为 PIO* (#PIOA_0)
 *
 * \return 返回 AMHW_GPIO_AF_* 这一类宏值 (# AMHW_GPIO_AF_0)
 */
am_static_inline
uint32_t amhw_hc32f460_gpio_pin_afr_get (amhw_hc32f460_gpio_t *p_hw_gpio, int pin)
{
    en_portx_t en_portx = AMHW_HC32F460_GPIO_PORT_A;
    uint8_t   pin_pos = 0u;
    amhw_hc32f460_gpio_afio_t enFuncSel;
    amhw_hc32f460_port_pfsr_field_t *PFSRx;

    __pin_calc(pin, &en_portx, &pin_pos);

    amhw_hc32f460_port_unlock(p_hw_gpio);
    PFSRx = (amhw_hc32f460_port_pfsr_field_t *)((uint32_t)(&(p_hw_gpio->PFSRA0)) \
            + 0x40ul * en_portx + 0x4ul * pin_pos);

    /* main function setting */
    enFuncSel = (amhw_hc32f460_gpio_afio_t)((PFSRx->FSEL) & 0x0000003f);
    amhw_hc32f460_port_lock(p_hw_gpio);
    return enFuncSel;

