zlgopen/ametal/soc/hdsc/drivers/include/gpio/hw/amhw_hc32f460_gpio.h
}

/**
 * \brief 设置GPIO引脚的模式
 *
 * \param[in] p_hw_gpio : 指向GPIO寄存器块的指针
 * \param[in] gpio_mode : 引脚的模式，值为 AMHW_HC32F460_gpiomode_t 这个枚举类型
 * \param[in] pin       : 引脚编号，值为 PIO* (#PIOA_0)
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_gpio_pin_mode_set (amhw_hc32f460_gpio_t       *p_hw_gpio,
                                 amhw_hc32f460_gpio_mode_t   gpio_mode,
                                 int                    pin)
{
    if (AMHW_HC32F460_GPIO_MODE_AIN == gpio_mode ) 
    {
        amhw_hc32f460_gpio_pin_analog_set(p_hw_gpio, pin);
        amhw_hc32f460_gpio_pin_dir_input(p_hw_gpio, pin);
    }
    else if (AMHW_HC32F460_GPIO_MODE_IN_FLOATING == gpio_mode ) 
    {
        amhw_hc32f460_gpio_pin_digital_set(p_hw_gpio, pin);
        amhw_hc32f460_gpio_pin_dir_input(p_hw_gpio, pin);
        amhw_hc32f460_gpio_pin_pu_disable(p_hw_gpio, pin);
    }
    else if (AMHW_HC32F460_GPIO_MODE_IPD == gpio_mode ) 
    {
        
    }
    else if (AMHW_HC32F460_GPIO_MODE_IPU == gpio_mode ) 
    {
        amhw_hc32f460_gpio_pin_digital_set(p_hw_gpio, pin);
        amhw_hc32f460_gpio_pin_dir_input(p_hw_gpio, pin);
        amhw_hc32f460_gpio_pin_pu_enable(p_hw_gpio, pin);

    }
    else if (AMHW_HC32F460_GPIO_MODE_OUT_PP == gpio_mode ) 
    {
        amhw_hc32f460_gpio_pin_digital_set(p_hw_gpio, pin);
        amhw_hc32f460_gpio_pin_dir_output(p_hw_gpio, pin);
        amhw_hc32f460_gpio_pin_od_disable(p_hw_gpio, pin);
    }
    else if (AMHW_HC32F460_GPIO_MODE_OUT_OD == gpio_mode ) 
    {
        amhw_hc32f460_gpio_pin_digital_set(p_hw_gpio, pin);
        amhw_hc32f460_gpio_pin_dir_output(p_hw_gpio, pin);
        amhw_hc32f460_gpio_pin_od_enable(p_hw_gpio, pin);
    }
    else if (AMHW_HC32F460_GPIO_MODE_AOUT == gpio_mode ) 
    {
        amhw_hc32f460_gpio_pin_analog_set(p_hw_gpio, pin);
        amhw_hc32f460_gpio_pin_dir_output(p_hw_gpio, pin);        
    }     
    else if (AMHW_HC32F460_GPIO_MODE_AF_PP == gpio_mode ) 
    {
        
    } 
    else if (AMHW_HC32F460_GPIO_MODE_AF_OD == gpio_mode ) 
    {
        
    }                                              
}


/**
 * @}
 */

/* 使用无名结构体和联合体区域的结束 */
#if defined(__CC_ARM)
    #pragma pop
#elif defined(__ICCARM__)
#elif defined(__GNUC__)
#elif defined(__TMS470__)
#elif defined(__TASKING__)
    #pragma warning restore
#else
    #warning Not supported compiler t
#endif

/**
 * @} AMHW_HC32F460_if_zlg_gpio
 */

#ifdef __cplusplus
}
#endif

#endif /* __AMHW_HC32F460_GPIO_H */

/* end of file */
